{
    "modules": {
        "levels": {
            "name": "Levels",
            "icon": "fas fa-layer-group",
            "desc": "Create maps with multiple vertical levels.",
            "fulldesc": "Create maps with multiple vertical levels on the same scene with seamless exploration and combat. Included 3D sight and more.",
            "status": "free",
            "media": "https://youtu.be/ELlweNunn4g",
            "link": "https://github.com/theripper93/Levels",
            "branch": "v9",
            "troubleshooting": [
                {
                    "title": "I have an issue with the levels module",
                    "desc": "Before anything else, if something does not look right, close the Levels UI and look from the perspective of a token."
                },
                {
                    "title": "Tokens are showing on levels they are not supposed to",
                    "desc": "The polygon for one or more of your floors is fucked, enable advanced mode in the Better Roofs settings and open a tile config to see it's preview, for technical details see the polygon video below"
                },
                {
                    "title": "Unexplored floors are revealed in the FoW",
                    "desc": "Try enabling the advanced fog of war in Levels module settings"
                },
                {
                    "title": "My Hole is not working",
                    "desc": "When setting the height range of a hole, imagine being inside it, now look down and look up, those 2 elevations are the ones you are looking for. This is also true when manually setting ranges for tiles."
                },
                {
                    "title": "Tokens not showing in holes",
                    "desc": "When you use Holes, keep in mind that you need transparency on the tile image itself where the hole is. Export it with transparency or cut a hole in it on photoshop or similar software"
                },
                {
                    "title": "I can't see the Polygon",
                    "desc": "Enable Advanced Mode in the Better Roofs settings"
                },
                {
                    "title": "One or more of my tokens view the wrong floor when at that floor's elevation",
                    "desc": "Odds are you are using metrics or that your token is 2x2 or larger. This is due to the token height. Please adjust it in Wall Height module settings or in the token configuration."
                },
                {
                    "title": "How does fog of war works in Levels?",
                    "desc": "Fog in foundry is monodimensional, the system itself is not build to handle multiple layers of fog, for that reason, by default, if you explored any elevation, all areas in that zone (independent of elevation) will also be explored. For example if a player explored a first floor of a building then went to the second floor, it would be already fully explored.<br>Since the only way to make it work correctly would be to completely rewrite the fog exploration system and even then there would be issues of storing multiple fogs (as it would take up load time on startup). Outside of this problem there would be even more issues because 'fog layers' could not be completely separate as exploring an area open to the sky would make it dark once you changed elevation.<br>Due to all this issues that currently have no solution levels implements what's called 'Advanced Fog Exploration'.<br>What this does is simple, when a player is in the elevation range of a tile, levels imposes a black shape of that tile onto the fog layer which basically means that it disables fog exploration for that tile only.<br>Unfortunately there is no solution currently to solve this problem, unless i missed something.<br>This is enabled by default, but you can globally disable it or even toggle it per tile."
                }
            ],
            "guides": [
                {
                    "title": "Tutorial Part 1",
                    "url": "https://youtu.be/ELlweNunn4g"
                },
                {
                    "title": "Tutorial Part 2",
                    "url": "https://youtu.be/_nynikU9_ao"
                },
                {
                    "title": "Tutorial Part 3",
                    "url": "https://youtu.be/NCg6T7lMrRs"
                },
                {
                    "title": "Dungeondraft",
                    "url": "https://youtu.be/STkloDe7NXU"
                },
                {
                    "title": "The Polygon",
                    "url": "https://youtu.be/HD4CXRmG5ss"
                },
                {
                    "title": "Settings",
                    "url": "https://youtu.be/2u3QpTa0Ld8"
                },
                {
                    "title": "On token Height (or LOS Height)",
                    "url": "https://youtu.be/ToUmTStUER8"
                },
                {
                    "title": "On the new UI",
                    "url": "https://youtu.be/NUmSFhhQjAI"
                }
            ]
        },
        "animated-walls": {
            "name": "Animated Walls",
            "icon": "fas fa-building-columns",
            "desc": "Animate your walls with rotation and movement animations.",
            "fulldesc": "Animate your walls with rotation and movement animations. Chain together animations with macros and hook macros on door opening.",
            "status": "free",
            "media": "https://streamable.com/wj3ecv",
            "link": "https://github.com/theripper93/animated-walls"
        },
        "enhancedcombathud": {
            "name": "Argon Combat HUD",
            "icon": "fas fa-shield-alt",
            "desc": "A combat hud for easy access to actions.",
            "fulldesc": "Show a Solasta inspired combat hud for easy accessibility of actions and bonus actions etc. Replaces a lot of the character sheet functionality during combat so that you don't need to open it. Basically, token action HUD on steroids.",
            "status": "free",
            "media": "https://youtu.be/ODKi0AuDNA8",
            "link": "https://github.com/theripper93/enhancedcombathud",
            "guides": [
                {
                    "title": "Argon Combat HUD Basic Tutorial",
                    "url": "https://youtu.be/W_nHwdf_3kw"
                }
            ]
        },
        "automated-evocations": {
            "name": "Automated Evocations",
            "icon": "fas fa-magic",
            "desc": "A UI for companion management.",
            "fulldesc": "A user interface to manage companions with summoning animations and automated summoning for spells.",
            "status": "free",
            "media": "https://youtu.be/lVTvbBXKiSg",
            "link": "https://github.com/theripper93/automated-evocations",
            "guides": [
                {
                    "title": "Automated Evocations Basic Tutorial",
                    "url": "https://youtu.be/VcAz8t6-lTY"
                },
                {
                    "title": "Automated Evocations Tutorial: Advanced Macros and More",
                    "url": "https://youtu.be/umXF2p0O12Y"
                }
            ]
        },
        "betterroofs": {
            "name": "Better Roofs",
            "icon": "fas fa-people-roof",
            "desc": "Overhead tile improvements with improved functionality and masking.",
            "fulldesc": "Improve overhead tiles by adding functionality to show them through the fog of war and even masking them based on vision to allow 'peeking' into windows/doors.",
            "status": "free",
            "media": "https://youtu.be/ELlweNunn4g",
            "link": "https://github.com/theripper93/Better-Roofs",
            "troubleshooting": [
                {
                    "title": "A roof is not showing or hiding properly",
                    "desc": "The polygon for one or more of your floors is fucked, enable advanced mode in the Better Roofs settings and open a tile config to see it's preview, for technical details see the polygon video below"
                },
                {
                    "title": "Mask mode is not working",
                    "desc": "Be sure you walled of the edges of your map"
                },
                {
                    "title": "Vision is getting blocked while it shouldn't",
                    "desc": "Be sure that your overhead tiles are not set to 'Roof' occlusion mode."
                }
            ]
        },
        "bossbar": {
            "name": "Boss Bar",
            "icon": "fas fa-skull-crossbones",
            "desc": "A Dark Souls-like boss healthbar. Customize texture, color and more.",
            "fulldesc": "Create a Dark Souls-like boss healthbar on top of the screen or in other locations. Customize texture, color and more.",
            "status": "free",
            "media": "https://youtu.be/o6FdsXB4Sqo",
            "link": "https://github.com/theripper93/Boss-Bar"
        },
        "lib-changelogs": {
            "name": "Changelogs",
            "icon": "fas fa-book-open",
            "desc": "Allows devs to display important messages to users after important updates.",
            "fulldesc": "Allow devs who opt into the system to display important messages to users after breaking updates, the user can chose which level of warning they wish to receive.",
            "status": "free",
            "media": "",
            "link": "https://github.com/theripper93/libChangelogs"
        },
        "combatbooster": {
            "name": "Combat Booster",
            "icon": "fas fa-bolt",
            "desc": "Speed up your combat with recent actions, turn marker and other tweaks.",
            "fulldesc": "Speed up your combat with Recent actions, Turn Marker and other smaller tweaks like Pan to combatant, body pile, mark defeated and more. (note that the recent action feature is only dnd5e compatible)",
            "status": "free",
            "media": "https://youtu.be/84UlBAnbFz4",
            "link": "https://github.com/theripper93/Combat-Booster"
        },
        "fuzzy-foundry": {
            "name": "Dig Down - Advanced Search",
            "icon": "fas fa-dungeon",
            "desc": "Search inside folders, filter searches, and many other advanced search features.",
            "fulldesc": "Search inside folders in the file picker, use special search terms to filter your sidebars and many other advanced search filters. Use the excavate functionality to automatically find images for tokens.",
            "status": "free",
            "media": "",
            "link": "https://github.com/theripper93/fuzzy-foundry"
        },
        "go-to-player": {
            "name": "Go To Player",
            "icon": "fas fa-arrow-alt-circle-up",
            "desc": "A simple module for GMs pan to players easily.",
            "fulldesc": "A simple module to get the GM to a specific player (go to it's viewed scene and pan the camera to their token). Simply click the new button in the player list context menu!",
            "status": "free",
            "media": "",
            "link": "https://github.com/theripper93/go-to-player"
        },
        "hover-distance": {
            "name": "Hover Distance",
            "icon": "fas fa-arrows-alt-h",
            "desc": "Shows the distance to a token on hover.",
            "fulldesc": "Show distance to a token on hover without the need to use the ruler. Optionally supports inclusion of vertical distance.",
            "status": "paid",
            "media": "https://youtu.be/0K0S8l_dEXw",
            "link": ""
        },
        "hurry-up": {
            "name": "Hurry Up",
            "icon": "fas fa-hourglass-half",
            "desc": "A simple timer to hurry up your players in combat!",
            "fulldesc": "A simple timer to hurry up your players in combat! Tired of those pesky players taking forever to then just swing a longsword after a 10 minute wait? Well, I have the solution for you!",
            "status": "free",
            "media": "",
            "link": "https://github.com/theripper93/hurry-up"
        },
        "ip-protect": {
            "name": "IP Shield",
            "icon": "fas fa-shield-alt",
            "desc": "A simple module for hiding ip fields in the invite menus.",
            "fulldesc": "Simple module to hide the ip fields in the invite links dialog.",
            "status": "free",
            "media": "",
            "link": "https://github.com/theripper93/ip-protect"
        },
        "levelsautocover": {
            "name": "Levels - Automatic Cover Calculator",
            "icon": "fas fa-crosshairs",
            "desc": "Calculates the precise cover percentage of tokens. Also adds the ability to duck!",
            "fulldesc": "Calculates a precise cover % that can be used on any system do display a custom message above a token (eg, if only 30% visible display the obscured text). Include options to consider defeated enemies as cover but at a reduced height and more. Preconfigured for dnd5e but works with all systems (Active Effects dnd5e only). Also adds the ability to duck!",
            "status": "paid",
            "media": "https://youtu.be/W4Fn5E7fsVA",
            "link": ""
        },
        "levelsvolumetrictemplates": {
            "name": "Levels - Volumetric Templates",
            "icon": "fas fa-ruler-combined",
            "desc": "Compute templates in 3D with autotargeting.",
            "fulldesc": "Compute templates in 3D with autotargeting. Automatic mode to dynamically switch between 2d and 3d depending on the information provided. Works with all systems, MIDI QOL compatible.",
            "status": "paid",
            "media": "https://youtu.be/UsD7XMk8TM8",
            "link": ""
        },
        "patrol": {
            "name": "Patrol",
            "icon": "fas fa-walking",
            "desc": "Patrol routes for NPCs with the option to spot player characters.",
            "fulldesc": "Automatic or Fixed Patrol Routes for NPCs with the ability to spot player characters. Have your npc wander around to make your city map breath life, have guards on patrol, this module has you covered! (Works very well in conjunction with Auto-Rotate).",
            "status": "free",
            "media": "https://youtu.be/iX2FlqmIJ1g",
            "link": "https://github.com/theripper93/Patrol"
        },
        "damage-numbers": {
            "name": "RPG Damage Numbers",
            "icon": "fas fa-9",
            "desc": "Show cascading damage numbers in the style of classic RPGs.",
            "fulldesc": "Show cascading damage numbers in the style of classic RPGs (for modern reference imagine Borderlands damage). Compatible only with dnd5e, requires midi-qol",
            "status": "paid",
            "media": "https://youtu.be/BTfQKNCP_HM",
            "link": ""
        },
        "smarttarget": {
            "name": "Smart Target",
            "icon": "fas fa-bullseye",
            "desc": "Quality of life improvements for targeting. Coloured pips or portrait indicators for targetted tokens, a targeting hotkey, and more.",
            "fulldesc": "Target with Alt+Click, For players, target by just left clicking a non-owned token, Show portraits instead of colored pips to indicate targets, fulldesc/offset and size of the icons can be configured in the module settings, Customize color/shape of the targeting reticule.",
            "status": "free",
            "media": "",
            "link": "https://github.com/theripper93/Smart-Target"
        },
        "splatter": {
            "name": "Splatter",
            "icon": "fas fa-tint",
            "desc": "Add blood and gore to your games. Give them that extra touch.",
            "fulldesc": "Add blood and gore to your games, Give that extra touch to your game. Featuring splats, blood trails, custom colors and more. Compatible with most game systems (minor configuration required).",
            "status": "free",
            "media": "https://youtu.be/jTqZv0OI5p4",
            "link": "https://github.com/theripper93/Splatter"
        },
        "dnd-randomizer": {
            "name": "Stochastic, Fantastic!",
            "icon": "fas fa-dice-d20",
            "desc": "A random encounter generator with automatic creature importing and loot generation.",
            "fulldesc": "A random encounter generator with automatic creature importing (from your own compendiums) and spawning plus loot generator (with automatic LootSheet creation). dnd5e only.",
            "status": "free",
            "media": "https://youtu.be/2RKL0uEvRF0",
            "link": "https://github.com/theripper93/dnd-randomizer"
        },
        "tile-sort": {
            "name": "Tile Sort",
            "icon": "fas fa-sort-alpha-down",
            "desc": "A quality of life module for tiles. Includes z-index sorting, vision toggle, and tile highlighting.",
            "fulldesc": "An easy to use tool to sort the z-index of tiles, includes also a toggle to hide one or more tiles (so you can work on tiles under them) and highlight to tiles on hover (so you can see a tile if it got lost under something).",
            "status": "free",
            "media": "https://youtu.be/xQycTn1rZ1g",
            "link": "https://github.com/theripper93/tile-sort"
        },
        "token-z": {
            "name": "Token Z",
            "icon": "fas fa-sort-amount-up",
            "desc": "Automatic sorting for the z-index of tokens by size and elevation.",
            "fulldesc": "Easily manage the Z-Index of tokens. The automatic sorting will keep larger tokens in the back and smaller ones in the front.",
            "status": "free",
            "media": "",
            "link": "https://github.com/theripper93/token-z"
        },
        "weatherblock": {
            "name": "Weather Blocker",
            "icon": "fas fa-cloud-sun",
            "desc": "A simple module for blocking weather effects on an area of a map. Includes Better Roofs and Levels integration.",
            "fulldesc": "A simple module to block weather effects on a map using drawings. Includes Better Roofs/Levels integration. Works with all systems.",
            "status": "free",
            "media": "",
            "link": "https://github.com/theripper93/Weather-Blocker"
        },
        "Taskbar": {
            "name": "Taskbar",
            "icon": "fas fa-tasks",
            "desc": "A Windows-style taskbar for Foundry. Include Start style menu and utility icons.",
            "fulldesc": "A fully functional Windows-style taskbar for Foundry. Manage your stuff the easy way! Includes a Windows-like Start menu and utility icons.",
            "status": "paid",
            "media": "https://youtu.be/d8AEZSPOiWo",
            "link": ""
        },
        "quickdraw": {
            "name": "Quickdraw",
            "icon": "fas fa-pencil-alt",
            "desc": "Make temporary drawings quickly and easily.",
            "fulldesc": "A rapid drawing tool to make quick drawings in-game by holding a hotkey (default q) with live preview for all clients. No more going to the drawing tools, and then deleting stuff! After a set timeout they will automatically fade out.",
            "status": "paid",
            "media": "https://youtu.be/lt5E3cHQ6uc",
            "link": ""
        },
        "config-presets": {
            "name": "Config Presets",
            "icon": "fas fa-boxes",
            "desc": "Save and apply presets for lights, walls, drawings, and more. The ultimate map making tool!",
            "fulldesc": "Save presets for lights/walls/drawings and more, keeps relevant module information and you can apply the presets to existing objects. The ultimate map making tool!",
            "status": "paid",
            "media": "https://youtu.be/A4qgviF_mqM",
            "link": ""
        },
        "light-switch": {
            "name": "Lightswitch",
            "icon": "fas fa-lightbulb",
            "desc": "Allow your players to switch chosen lights on and off with a click.",
            "fulldesc": "Simply enable a toggle in the light configuration and now your players will be able to switch on and off the light with a simple click on an icon on the map that is also restricted by sight! No other configuration required.",
            "status": "paid",
            "media": "https://youtu.be/qa_Xd8M1vhg",
            "link": ""
        },
        "journal-drop": {
            "name": "Journal Drop",
            "icon": "fas fa-book-open",
            "desc": "Place multiple pins of the same journal on the canvas, automagically split by subtitles",
            "fulldesc": "Click a button to place multiple pins of the same journal on the canvas. Each copy will be labeled according to the section of the journal. This will NOT create new journals but use the single existing one ! The splitting is done automagically, in case your journal is not using h1 or h3 for it's sections you can specify a custom one. Also adds the ability to show journals as tooltips on hover.",
            "status": "paid",
            "media": "https://youtu.be/WgN106xJdvI",
            "link": ""
        },
        "filepicker-plus": {
            "name": "Filepicker+",
            "icon": "fas fa-file",
            "desc": "An alternative to the default filepicker with a fresh UI. Adds favourites, image and video previews, and audio tooltips.",
            "fulldesc": "Expands the default filepicker to add favourite folders, image and video preview tooltips, audio tooltips and a new layout",
            "status": "paid",
            "media": "https://youtu.be/kCZvri65OvU",
            "link": ""
        },
        "progress-tracker": {
            "name": "Progress Tracker",
            "icon": "fas fa-sliders-h",
            "desc": "Create bars with backgrounds, sliders and waypoints to track progress for your players.",
            "fulldesc": "Create bars with custom backgrounds, sliders and waypoints to track many things like Travel, Chases and more. All changes are synced to players!",
            "status": "paid",
            "media": "https://youtu.be/C9KdHW0yeDk",
            "link": ""
        },
        "situational-shortcuts": {
            "name": "Situational Shortcuts",
            "icon": "fas fa-link",
            "desc": "Adds a quick custom button near the 'Situational Bonus' field. Perfect for low automation users.",
            "fulldesc": "Whatever you use is, sometimes applying active effects slows down the game. This modules adds quick custom button near the 'Situational Bonus' field. This is perfect for low automation users and for those things that are to annoying to automate with active effects! (currently dnd5e only - more systems coming on request)",
            "status": "paid",
            "media": "https://youtu.be/RgkLjIo17kQ",
            "link": ""
        },
        "quick-doors": {
            "name": "Quick Doors",
            "icon": "fas fa-door-open",
            "desc": "Create and delete walls, doors, and windows with a single click on existing walls.",
            "fulldesc": "Very simple, enable the tool, now clicking near a wall will create a door (on the wall itself) while splitting the original wall appropriately, you can also snap to grid to auto align everything nicely. Includes hotkeys to swap between grid/nogrid/secret/window",
            "status": "paid",
            "media": "https://youtu.be/iWkTeQFGs3U",
            "link": ""
        },
        "image-context": {
            "name": "Image Context",
            "icon": "fas fa-image",
            "desc": "Creates a context menu for images. Display a pop-out of the image, send it to chat, whisper it to specific players, and more.",
            "fulldesc": "Add a context menu when you right click on any image in foundry. From this menu, show a pop-out of the image or send it to chat with the ability to whisper it only to some players and more.",
            "status": "paid",
            "media": "https://youtu.be/C64JxiTFeyg",
            "link": ""
        },
        "inactive-tokens-lmao": {
            "name": "Inactive Tokens",
            "icon": "fas fa-user-slash",
            "desc": "Set tokens as inactive to make them non-interactable and indistinguishable from tiles.",
            "fulldesc": "Set token as inactive to make them non-interactable, effectively making them indistinguishable from tiles by players. Also, exclude inactive tokens from drag selection and optionally automatically set a token as inactive when defeated.",
            "status": "paid",
            "media": "https://youtu.be/HCGMk4QN8q4",
            "link": ""
        },
        "levels-3d-preview": {
            "name": "3D Canvas",
            "icon": "fas fa-cube",
            "desc": "Turn your maps into true 3D! Play your games in the glorious third dimension.",
            "fulldesc": "Turn your maps into true 3D, load in 3D models, and play your games in the glorious third dimension. Supports lighting and animated models. If you don't have 3D models don't worry! 3D canvas will turn your 2D tokens into stand-up figures in 3D mode.",
            "status": "paid",
            "media": "https://youtu.be/rziXLJEfxqI",
            "link": "",
            "guides": [
                {
                    "title": "3D Canvas 2.0 Trailer",
                    "url": "https://youtu.be/h_EZ08wD4c4"
                },
                {
                    "title": "3D Canvas 1.0 Trailer",
                    "url": "https://youtu.be/hC1QGZFUhcU"
                },
                {
                    "title": "Feature showcase and tutorial",
                    "url": "https://youtu.be/C5Fv8uU0tkc"
                },
                {
                    "title": "Frequently Asked Questions",
                    "url": "https://youtu.be/-eu-zTtRnLQ"
                },
                {
                    "title": "Converting STLs with Blender",
                    "url": "https://youtu.be/j8sZ-VM0FoI"
                },
                {
                    "title": "How to 3d-ify 2D battlemaps with Blender",
                    "url": "https://youtu.be/n6FVHp3wr0I"
                },
                {
                    "title": "3D Dungeons with the Dungeon Pack",
                    "url": "https://youtu.be/wvd7Wm7WvHQ"
                },
                {
                    "title": "Advanced 3D Map Creation",
                    "url": "https://youtu.be/9BFukGHHvnI"
                },
                {
                    "title": "3D Canvas Live Gameplay",
                    "url": "https://youtu.be/ioxbrPI1qQ0"
                }
            ]
        },
        "choices": {
            "name": "Visual Novel Choices",
            "icon": "fas fa-book-reader",
            "desc": "Create a visual novel-style choice menu. Includes player voting, visual customization, scene changes, and macro execution.",
            "fulldesc": "Create a visual novel style choice menu with a list of choices and a title. Make democratic or non votes, customize colors and background image, and trigger scene changes or macros when a choice is resolved.",
            "status": "paid",
            "media": "https://youtu.be/l_e-I_B3j18",
            "link": ""
        },
        "mmm": {
            "name": "Maxwell's Manual of Malicious Maladies",
            "icon": "fas fa-user-injured",
            "desc": "A module for all your lingering injuries needs.",
            "fulldesc": "A module for all your lingering injuries needs (dnd5e). 208 lingering injuries all with different severities, durations, and consequences, based on the 13 different damage types. Includes application automation, durations and item creation to keep track of injuries!",
            "status": "free",
            "media": "",
            "link": "https://github.com/theripper93/Maxwell-s-Manual-of-Malicious-Maladies"
        },
        "socketmacros": {
            "name": "Socket Macros",
            "icon": "fas fa-plug",
            "desc": "Execute macros on all clients with a tick of a checkbox.",
            "fulldesc": "A very simple module to execute macros on all clients - simply check the checkbox in the macro configuration and the macro will be fired on all clients!",
            "status": "paid",
            "media": "https://youtu.be/FlK2pQPvy0c",
            "link": ""
        },
        "tokenflip": {
            "name": "Token Flip",
            "icon": "fas fa-exchange-alt",
            "desc": "Assign multiple token images and actors to the same token and flip between them with ease and a nice animation!",
            "fulldesc": "Assign multiple token images and actors to the same token and flip between them with ease and a nice animation!",
            "status": "paid",
            "media": "https://youtu.be/W-2EVLscFLM",
            "link": ""
        },
        "token-notes": {
            "name": "Token Notes",
            "icon": "fas fa-sticky-note",
            "desc": "Take quick notes on tokens. Great for tracking effects and values during combat, especially if you are not using automation!",
            "fulldesc": "With this simple yet effective module you can take quick notes on tokens. The module is system agnostic and excels at tracking effects durations during combat, especially if you are not using automation!",
            "status": "paid",
            "media": "https://youtu.be/bb6IS7kt490",
            "link": ""
        },
        "wall-height": {
            "name": "Wall Height",
            "icon": "fas fa-building",
            "desc": "Set the height of walls so that tokens can look and move over them.",
            "fulldesc": "Adds the ability to set wall height for walls so that tokens can look and move over them.",
            "status": "free",
            "media": "https://youtu.be/EADY8HhTXZE",
            "link": "https://github.com/theripper93/wall-height",
            "troubleshooting": [
                {
                    "title": "Movement is blocked when it shouldn't",
                    "desc": "Be sure that you don't have walls that are below walls set to the wrong elevation."
                }
            ]
        },
        "canvas3dcompendium": {
            "name": "3D Canvas Compendium",
            "icon": "fas fa-book",
            "desc": "A compendium with 3D Maps and Tokens.",
            "fulldesc": "A compendium of Premade 3d maps and 3D Tokens ready to use. Also includes Skyboxes and HDRI (exr) files for your scenes!",
            "status": "free",
            "media": "",
            "link": "https://github.com/theripper93/canvas3dcompendium"
        },
        "canvas3dtokencompendium": {
            "name": "3D Canvas Token Collection",
            "icon": "fas fa-book",
            "desc": "A Collection of 3000+ 3D Miniatures.",
            "fulldesc": "A Collection of 3000+ 3D Miniatures ready to use in 3D Canvas. Includes 1000+ Heroes and most creatures from every DnD published book. This collection is availeble for free if you wish to use it in other software.",
            "status": "free",
            "media": "",
            "link": "https://github.com/theripper93/canvas3dtokencompendium"
        },
        "theripper-premium-hub": {
            "name": "TheRipper93's Module Hub",
            "icon": "fas fa-code-branch",
            "desc": "Updates and Notifications for my modules.",
            "fulldesc": "Automatically check for my premium modules updates and recive notifications for Critical Updates on my Free Modules and new Free and Premium Releases.",
            "status": "free",
            "media": "",
            "link": "https://github.com/theripper93/theripper-premium-hub"
        },
        "levels-layer-effects": {
            "name": "Levels - Depth Blur",
            "icon": "fas fa-low-vision",
            "desc": "Automatic Elevation based Blur effect.",
            "fulldesc": "Automatically apply a blur effect to your Levels and tokens depending on the current elevation. The farther you are from a level, the more blur you will get.",
            "status": "paid",
            "media": "https://youtu.be/QmEZRmpYLYU",
            "link": "",
            "guides": [
                {
                    "title": "How to use Levels - Depth Blur",
                    "url": "https://youtu.be/EptprFHaSCw"
                }
            ]
        },
        "three-actor-portrait": {
            "name": "3D Portraits",
            "icon": "fas fa-user-circle",
            "desc": "Use 3D Models as Actor Portraits.",
            "fulldesc": "Use 3D Models as Actor Portraits or Items. HeroForge integration lets you import your 3D Heros from HeroForge. 3D Portraits is not an officially HeroForge® supported module",
            "status": "paid",
            "media": "https://youtu.be/te1pQ2-5KtQ",
            "link": "",
            "troubleshooting": [
                {
                    "title": "How do I enable the HeroForge integration?",
                    "desc": "To enable the integration, set the Authentication Key in the module settings. You can find further instructions in the setting's description."
                },
                {
                    "title": "I cannot see my HeroForge miniatures after enabling the integration.",
                    "desc": "Only miniatures purchased as '3D Digital' will be available."
                }
            ]
        }
    },
    "faqs": [
        {
            "question": "How do I install your Free or Premium modules?",
            "answer": "For installation instructions, please visit the installation subpage.",
            "link": "",
            "status": "free"
        },
        {
            "question": "I'm having an issue with one of your modules. What should I do?",
            "answer": "First visit the basic troubleshooting page, then check the module readme (linked in the module page) for the module you have having issues with. Follow instructions on how to resolve the issue. If you still cannot resolve the issue contact me on discord with the information you acquired from these steps.",
            "link": "",
            "status": "free"
        },
        {
            "question": "I think I've found a bug. How do I report it?",
            "answer": "Before reporting a bug, please visit the Bug Report page and follow the instructions to provide me with the most information to quickly resolve the issue.",
            "link": "",
            "status": "free"
        },
        {
            "question": "I'm a Patreon, how do I get access to the modules?",
            "answer": "You can find Download links to all the premium modules in the respective module page on this website. The list of modules is on the front page.",
            "link": "",
            "status": "paid"
        },
        {
            "question": "How does the Patreon subscription work?",
            "answer": "You can subscribe to the Supporter tier to get access to the full premium module collection. You will be charged monthly for the subscription. You can cancel your subscription at any time.",
            "link": "",
            "status": "paid"
        },
        {
            "question": "What happens when I cancel my subscription?",
            "answer": "You will keep all the modules you have downloaded but you will not be able to access future updates. Any content you haven't downloaded will no longer be accessible.",
            "link": "",
            "status": "paid"
        },
        {
            "question": "I want to upgrade my subscription. Do I get charged extra?",
            "answer": "No, if you upgrade your tier you will only be charged the price difference between the new tier and the old tier.",
            "link": "",
            "status": "paid"
        },
        {
            "question": "I'm a Creator and I want to use Levels/Better Roofs in my commercial products. Can I do that?",
            "answer": "Yes, but you will need to subscribe to the commercial tier or provide credit to my work in your releases. \nPlease see the 'Terms of Use' post on Patreon or contact me for details.",
            "link": "",
            "status": "paid"
        },
        {
            "question": "I'm a Creator tier Patron but I no longer want to use your modules commercially. Can I cancel my subscription?",
            "answer": "Absolutely! If you are a Creator and cancel your subscription you can keep selling any content you published prior to cancelling your subscription. \nYou will need to provide credit to my work in any future release you make that uses my modules.",
            "link": "",
            "status": "paid"
        },
        {
            "question": "I published some commercial content without the Creator tier, but now I'm a Creator Patreon, can i remove the credits from my previews published content?",
            "answer": "No, any content published while not on an active Creator subscription will need to keep the credits.",
            "link": "",
            "status": "paid"
        }
    ],
    "troubleshooting": [
        {
            "title": "Step 1: Check for updates.",
            "description": "Check for any updates that might be available for the module you are having issues with and all of it's dependencies."
        },
        {
            "title": "Step 2: Disable all other modules.",
            "description": "Issues can sometimes be caused by a conflicting module. Disable all modules except the module you are having issues with and it's dependencies and check if the issue persists. You can use modules like Tidy UI to export your enabled module list to make the process easier and faster. If you determine that a conflict is the reason of your issue, use the 'Find the Culprit' module to determine what module is conflicting and communicate it to me on discord. I'll make sure to contact the developer and try to get the issue resolved if possible."
        },
        {
            "title": "Step 3: Check the console for errors.",
            "description": "Open the browser or Foundry App console (F12). Check if you have any errors (Red boxes with long text) in the console. If you have any console errors the issue is most likely a bug, proceed to step 6"
        },
        {
            "title": "Step 4: Check the module readme.",
            "description": "Check the respective module page on this site for useful information and a link to the module readme (linked in the module page)."
        },
        {
            "title": "Step 5: Reinstall and restart.",
            "description": "If the issue seems to bad to be true, sometimes it can be a broken installation or a caching issue. Reinstall the module and restart the server. You can skip this step if the issue is minor, this is usually reserved to major issues like the module not working at all."
        },
        {
            "title": "Step 6a: Contact me.",
            "description": "If the issue is still not resolved, please contact me on discord and provide me with the information you acquired from the basic troubleshooting. I'll try to get the issue resolved as soon as possible."
        },
        {
            "title": "Step 6b: Report the bug.",
            "description": "If you believe the issue to be a Bug please follow the instruction in the Bug Report page."
        }
    ],
    "issues": [
        {
            "title": "Help/Troubleshooting",
            "description": "If you have issues setting up one of my modules or using one or more of it's features check the Troubleshooting page then post in the #troubleshooting discord channel, help/setup request in the github issues will be ignored and closed."
        },
        {
            "title": "Feature requests/Enhancements",
            "description": "Post your feature request on discord, the issue tracker on github is just used to track bugs. If you post a feature request it will be automatically closed. Use the #feature-requests-public channel or the higher priority #feature-requests channel (if you are a Patreon)"
        },
        {
            "title": "Bugs",
            "description": "You can post bugs in the issues of the repo or on the discord. Generally the discord is preferred since it allows for faster interactions and troubleshooting. Whether you are posting the issue here or on discord follow the bug report template or your issue will be closed. If you have clear steps to reproduce the issue report the bug in the github issues or in the #bug-report channel on discord. If you don't have clear steps to reproduce check the Troubleshooting page then post in the #troubleshooting discord channel instead"
        },
        {
            "title": "Before Reporting",
            "description": [
                "Make sure you followed the steps in the Troubleshooting page first.",
                "Try to isolate the issue as much as possible (try to reproduce it on a new scene with minimal amount of factors).",
                "Provide a list of steps to take to reproduce the issue.",
                "Once you have this informations use the Bug Report Template."
            ]
        },
        {
            "title": "Bug Report Template",
            "footer": "Please make sure you completed all the steps and checked the required boxes.",
            "screenerr": "Screenshots and/or Console Errors",
            "description": [
                {
                    "title": "I have disabled all other modules",
                    "placeholder": false
                },
                {
                    "title": "Bugged Module(s):",
                    "placeholder": "Name and version"
                },
                {
                    "title": "Conflicting Module(s):",
                    "placeholder": "Name and version—if none, leave blank"
                },
                {
                    "title": "Foundry and System version:",
                    "placeholder": "e.g. Foundry 0.8.9, DnD5e 1.5.5"
                },
                {
                    "title": "OS, Hosting, Browser (if applicable):",
                    "placeholder": "e.g. Windows 10, The Forge, Chrome"
                },
                {
                    "title": "Short Description of bug:",
                    "placeholder": "e.g. 'I can't place tiles on the map'"
                },
                {
                    "title": "Simple steps to reproduce the bug:",
                    "placeholder": "Be precise and clear"
                },
                {
                    "title": "I will include Screenshots and/or console errors when posting the message or issue",
                    "placeholder": false
                }
            ]
        }
    ],
    "free": "Free",
    "paid": "Premium"
}